EinkaufsListe_RoR/app/views/stores/index.html.erb

SELECT COUNT(*) FROM "addresses"
---
    <td><%= store.name %></td>
    <% if Address.count > 0 %>