EinkaufsListe_RoR/app/views/users/index.html.erb

    <td><%= user.username %></td>
    <% if user.shoppingList.exists? %>
        <td><%= link_to "List", :action=>"index", :controller=>"shopping_lists" %></td>
        <% if Article.count > 0 %>
---
SELECT 1 FROM "shopping_lists" WHERE "shopping_lists"."user_id" = 1 LIMIT 1
SELECT COUNT(*) FROM "articles"


<% if Store.count > 0 %>
---
SELECT COUNT(*) FROM "stores"