EinkaufsListe_RoR/app/views/users/show.html.erb

  <b>Shoppinglist:</b>
<% if @user.shoppingList.exists? %>
---
SELECT 1 FROM "shopping_lists" WHERE "shopping_lists"."user_id" = 1 LIMIT 1