EinkaufsListe_RoR/app/views/shopping_lists/index.html.erb

SELECT COUNT(*) FROM "articles"
---
    <td><%= link_to shopping_list.user.username, :action=>"index", :controller=>"users"  %></td>
    <% if Article.count > 0 %>

SELECT COUNT(*) FROM "stores"
---
<br />
<% if !@shopping_lists.blank? && Store.count > 0 %>